tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "microsoft/git"
# Display user-friendly message boxes from shell scripts
brew "dialog"
# Modern replacement for 'ls'
brew "exa"
# Read, write, modify, and display EXIF data on the command-line
brew "exif"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Add GitHub support to git on the command-line
brew "hub"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven", link: false
# Java-based project management
brew "maven@3.2", link: true
# Move, copy, append, and link multiple files
brew "mmv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@12"
# Platform built on V8 to build network applications
brew "node@14", link: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Text replacement utility
brew "rpl"
# Encrypt/decrypt using SSH keys
brew "ssh-vault"
# Implementation of Java Servlet and JavaServer Pages
brew "tomcat@9", restart_service: true, link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Vault
brew "hashicorp/tap/vault", link: false
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
cask "git-credential-manager-core"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Java IDE by JetBrains
cask "intellij-idea"
# Open-source keystroke visualizer
cask "keycastr"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Collaboration platform for API development
cask "postman"
# VPN client focusing on security
cask "protonvpn"
# Digital design and prototyping platform
cask "sketch"
# Team communication and collaboration software
cask "slack"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organize, cite, and share research sources
cask "zotero"
mas "Bitwarden", id: 1352778147
mas "Gifski", id: 1351639930
